{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_65", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 150, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_22", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_59", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_22", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_23", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_60", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_23", "inbound_nodes": [[["bidirectional_22", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_82", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_82", "inbound_nodes": [[["bidirectional_23", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_83", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_83", "inbound_nodes": [[["dense_82", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_84", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_84", "inbound_nodes": [[["dense_83", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["dense_84", 0, 0]]}}, "training_config": {"loss": "mae", "metrics": ["mae"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0003000000142492354, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_22/forward_lstm_59/lstm_cell_104/kernel", "shape": [2, 256], "dtype": "float32"}, {"name": "bidirectional_22/forward_lstm_59/lstm_cell_104/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_22/forward_lstm_59/lstm_cell_104/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_22/backward_lstm_59/lstm_cell_105/kernel", "shape": [2, 256], "dtype": "float32"}, {"name": "bidirectional_22/backward_lstm_59/lstm_cell_105/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_22/backward_lstm_59/lstm_cell_105/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_23/forward_lstm_60/lstm_cell_107/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_23/forward_lstm_60/lstm_cell_107/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_23/forward_lstm_60/lstm_cell_107/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_23/backward_lstm_60/lstm_cell_108/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_23/backward_lstm_60/lstm_cell_108/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_23/backward_lstm_60/lstm_cell_108/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_82/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_82/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_83/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_83/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_84/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "dense_84/bias", "shape": [1], "dtype": "float32"}]}]}